
#TODO Функция принимает на вход список словарей с данными о банковских операциях и параметр
# state
# , возвращает новый список, содержащий только те словари, у которых ключ
# state
#  содержит переданное в функцию значение.
# Параметр
# state
#  функции имеет значение по умолчанию
# 'EXECUTED'
def filter_by_state():
    pass

#TODO Функция принимает на вход список словарей и параметр порядка сортировки, возвращает новый список, в котором исходные словари отсортированы по дате.
# Параметр порядка сортировки функции имеет значение по умолчанию
# 'True'
def sort_by_date():
    pass